tutorials/PFB_3D_resolved/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.00003;

boundaryField
{
    
    "(outlet|inlet|atmosphere)"
    {
        type            inletOutlet;
        inletValue      uniform 0.00003;
        value           uniform 0.00003;
    }

    "(stationaryWalls|floater|BB1|BB2|BB3|frontAndback)"
    {
        type            kqRWallFunction;
        value           uniform 0.00003;
    }
}


// ************************************************************************* //
